In [7]:
import pandas as pd

ventas = pd.DataFrame({
    "id_Producto": [1, 2, 3, 1, 2],
    "ventas": [10, 15, 8, 20, 5]
})

ventas

   id_Producto  ventas
0            1      10
1            2      15
2            3       8
3            1      20
4            2       5

In [8]:
productos = pd.DataFrame({
    "id_Producto": [1, 2, 3],
    "producto": ["Chocolate", "Vainilla", "Fresa"],
    "precio": [180, 150, 160]
})

productos

   id_Producto   producto  precio
0            1  Chocolate     180
1            2   Vainilla     150
2            3      Fresa     160

In [11]:
df_inner = pd.merge(ventas, productos, on="id_Producto", how="inner")
df_inner

   id_Producto  ventas   producto  precio
0            1      10  Chocolate     180
1            2      15   Vainilla     150
2            3       8      Fresa     160
3            1      20  Chocolate     180
4            2       5   Vainilla     150

In [12]:
df_left = pd.merge(ventas, productos, on="id_Producto", how="left")
df_left

   id_Producto  ventas   producto  precio
0            1      10  Chocolate     180
1            2      15   Vainilla     150
2            3       8      Fresa     160
3            1      20  Chocolate     180
4            2       5   Vainilla     150

In [14]:
df_right = pd.merge(ventas, productos, on="id_Producto", how="right")
df_right

   id_Producto  ventas   producto  precio
0            1      10  Chocolate     180
1            1      20  Chocolate     180
2            2      15   Vainilla     150
3            2       5   Vainilla     150
4            3       8      Fresa     160

In [15]:
df_outer = pd.merge(ventas, productos, on="id_Producto", how="outer")
df_outer

   id_Producto  ventas   producto  precio
0            1      10  Chocolate     180
1            1      20  Chocolate     180
2            2      15   Vainilla     150
3            2       5   Vainilla     150
4            3       8      Fresa     160

In [16]:
df_inner["ingreso"] = df_inner["ventas"] * df_inner["precio"]
df_inner

   id_Producto  ventas   producto  precio  ingreso
0            1      10  Chocolate     180     1800
1            2      15   Vainilla     150     2250
2            3       8      Fresa     160     1280
3            1      20  Chocolate     180     3600
4            2       5   Vainilla     150      750

In [17]:
df_inner.groupby("producto")["ingreso"].sum()

producto
Chocolate    5400
Fresa        1280
Vainilla     3000
Name: ingreso, dtype: int64